OpenDTEF-v2012/tutorials/incompressible/pimpleFoam/laminar/sloshing2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type        freeSurfacePressure;
        pa          uniform 0;
    }
    bottom
    {
        type        zeroGradient;
    }
    left
    {
        type        zeroGradient;
    }
    right
    {
        type        zeroGradient;
    }
    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
